"""Задача 3. Непрерывная случайная величина X распределена нормально и задана плотностью
распределения
f(x) = (1 / (4 * sqrt(2pi))) * exp((-(x+2)**2) / 32)
Найдите:
а). M(X)
б). D(X)
в). std(X) (среднее квадратичное отклонение)"""

s = 4
m_х = -2
d_x = 16

print(f" M(X) = {m_х}, D(X) = {d_x}, std(X) = {s} ")

"M(X) = -2, D(X) = 16, std(X) = 4 "
