"""Задача 3. Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175
Используя эти данные построить 95% доверительный интервал для разности среднего
роста родителей и детей"""
import math

import numpy as np
import scipy.stats as stats

mothers = np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])
daughters = np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
n1 = len(mothers)
n2 = len(daughters)
x_1 = np.mean(mothers)
x_2 = np.mean(daughters)
delta = abs(x_1 - x_2)
print(f"разность средних {delta:.3}")
D1 = np.var(mothers, ddof=1)
D2 = np.var(daughters, ddof=1)
D = (D1 + D2) / 2
SE = np.sqrt(D / n1 + D / n2)
print(f"стандартная ошибка разности средних {SE:.3}")

t = stats.t.ppf(0.975, 18)
print(f"критерий Стьюдента {t:.3}")
L = delta - t * SE
U = delta + t * SE
print(f"Доверительный интервал: [{L:.3};{U:.3}]")
"""разность средних 1.9
стандартная ошибка разности средних 3.89
критерий Стьюдента 2.1
Доверительный интервал: [-6.27;10.1]"""
