"""Задача 2 Посчитать коэффициент линейной регрессии при заработной плате (zp), используя
градиентный спуск (без intercept)"""
import numpy as np

x = np.array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])
y = np.array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])

alfa = 1e-5
b1 = 0.1
n = len(x)
for i in range(40):
    b1 -= alfa * (2 / n) * np.sum((b1 * x - y) * x)
    print(f"b1={b1}")
"""b1=5.889792661698099
b1=5.889800310035098
b1=5.889805851010507"""